// /** @file
// Vtf0SecCore Localized Abstract and Description Content.
//
// Copyright (c) 2014 - 2016, Intel Corporation. All rights reserved.<BR>
//
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php.
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// **/

#string STR_MODULE_ABSTRACT
#language en-US
"Vft0SecCore module: SEC Core"

#string STR_MODULE_DESCRIPTION
#language en-US
"This is the first module taking control of the platform upon power-on/reset. "
"It implements the first phase of the security phase. The entry point function is "
"_ModuleEntryPoint in PlatformSecLib. This module is expected to co-work "
"with the reset vector binary located in UefiCpuPkg\\ResetVector\\Vft0. The "
"VTF0 binary transitions to IA32 flat mode, then locates and jumps to this "
"module's entry point function."


